curlexamples/vehicle-description-no-password.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="urn:description7a.services.chrome.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <ns0:Body>
      <ns1:VehicleDescriptionRequest>
          <ns1:accountInfo number="123456" secret="xxxxxxxxxxxxxxxx" country="US" language="en"/>
          <ns1:vin xmlns:ns1="urn:description7a.services.chrome.com">KMHCN4AC7AU407141</ns1:vin>
      </ns1:VehicleDescriptionRequest>
   </ns0:Body>
</SOAP-ENV:Envelope>
