test/fixtures/vcr_cassettes/2013/divisions/13/models.yml

---
http_interactions:
- request:
    method: post
    uri: http://services.chromedata.com/Description/7a
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <soap:Envelope xmlns:ns0="urn:description7a.services.chrome.com" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Header/>
          <soap:Body>
            <ns0:ModelsRequest>
              <ns0:accountInfo number="123456" secret="1111111111111111" country="US" language="en"/>
              <ns0:modelYear>2013</ns0:modelYear>
              <ns0:divisionId>13</ns0:divisionId>
            </ns0:ModelsRequest>
          </soap:Body>
        </soap:Envelope>
    headers:
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '450'
      Soapaction:
      - ''
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 24 Mar 2017 21:53:58 GMT
      Server:
      - Apache/2.2.15 (CentOS)
      Content-Length:
      - '1956'
      P3p:
      - CP="NOI ADMa CUR DEVa OUR IND TAI BUS UNI"
      Connection:
      - close
      Content-Type:
      - text/xml;charset=utf-8
      Chrome:
      - '8.215'
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><Models
        xmlns="urn:description7a.services.chrome.com"><responseStatus responseCode="Successful"
        description="Successful"/><model id="25459">C-Max Energi</model><model id="25455">C-Max
        Hybrid</model><model id="25134">Econoline Cargo Van</model><model id="25567">Econoline
        Commercial Chassis</model><model id="25568">Econoline Commercial Cutaway</model><model
        id="25565">Econoline Wagon</model><model id="24937">Edge</model><model id="25055">Escape</model><model
        id="25572">Expedition</model><model id="25573">Expedition EL</model><model
        id="24934">Explorer</model><model id="25621">F-150</model><model id="25199">Fiesta</model><model
        id="24973">Flex</model><model id="25451">Focus</model><model id="25458">Focus
        Electric</model><model id="25457">Fusion</model><model id="25886">Fusion Energi</model><model
        id="24997">Mustang</model><model id="21803">Sedan Police Interceptor</model><model
        id="25801">Super Duty F-250 SRW</model><model id="25777">Super Duty F-350
        DRW</model><model id="25802">Super Duty F-350 DRW</model><model id="25776">Super
        Duty F-350 SRW</model><model id="25805">Super Duty F-350 SRW</model><model
        id="25790">Super Duty F-450 DRW</model><model id="25778">Super Duty F-450
        DRW</model><model id="25341">Super Duty F-53 Motorhome</model><model id="25779">Super
        Duty F-550 DRW</model><model id="25342">Super Duty F-59 Stripped Chassis</model><model
        id="25914">Super Duty F-650 Pro Loader</model><model id="25915">Super Duty
        F-650 Pro Loader Gas</model><model id="25916">Super Duty F-650 Straight Frame</model><model
        id="25917">Super Duty F-650 Straight Frame Gas</model><model id="25918">Super
        Duty F-750 Straight Frame</model><model id="24933">Taurus</model><model id="25135">Transit
        Connect</model><model id="25345">Transit Connect Wagon</model><model id="21811">Utility
        Police Interceptor</model></Models></S:Body></S:Envelope>
    http_version:
  recorded_at: Fri, 24 Mar 2017 21:53:58 GMT
recorded_with: VCR 3.0.3
