test/fixtures/vcr_cassettes/2013/divisions/13/models/24997/styles.yml

---
http_interactions:
- request:
    method: post
    uri: http://services.chromedata.com/Description/7a
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <soap:Envelope xmlns:ns0="urn:description7a.services.chrome.com" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Header/>
          <soap:Body>
            <ns0:StylesRequest modelId="24997">
              <ns0:accountInfo number="123456" secret="1111111111111111" country="US" language="en"/>
            </ns0:StylesRequest>
          </soap:Body>
        </soap:Envelope>
    headers:
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '382'
      Soapaction:
      - ''
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 24 Mar 2017 21:54:21 GMT
      Server:
      - Apache/2.2.15 (CentOS)
      Content-Length:
      - '733'
      P3p:
      - CP="NOI ADMa CUR DEVa OUR IND TAI BUS UNI"
      Connection:
      - close
      Content-Type:
      - text/xml;charset=utf-8
      Chrome:
      - '8.214'
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><Styles
        xmlns="urn:description7a.services.chrome.com"><responseStatus responseCode="Successful"
        description="Successful"/><style id="349411">2dr Conv GT</style><style id="349412">2dr
        Conv GT Premium</style><style id="349413">2dr Conv Shelby GT500</style><style
        id="349409">2dr Conv V6</style><style id="349410">2dr Conv V6 Premium</style><style
        id="349407">2dr Cpe Boss 302</style><style id="349405">2dr Cpe GT</style><style
        id="349406">2dr Cpe GT Premium</style><style id="349408">2dr Cpe Shelby GT500</style><style
        id="349403">2dr Cpe V6</style><style id="349404">2dr Cpe V6 Premium</style></Styles></S:Body></S:Envelope>
    http_version:
  recorded_at: Fri, 24 Mar 2017 21:54:21 GMT
recorded_with: VCR 3.0.3
